local ____lualib = require("lualib_bundle")
local __TS__SourceMapTraceBack = ____lualib.__TS__SourceMapTraceBack
__TS__SourceMapTraceBack(debug.getinfo(1).short_src, {["5"] = 4,["6"] = 4,["7"] = 37,["8"] = 38,["9"] = 38,["10"] = 38,["11"] = 38,["12"] = 38,["13"] = 38,["14"] = 38,["15"] = 38,["16"] = 37,["17"] = 47,["18"] = 47,["19"] = 47,["20"] = 47,["21"] = 47,["22"] = 47,["23"] = 47,["24"] = 47,["25"] = 37,["26"] = 56,["27"] = 56,["28"] = 56,["29"] = 56,["30"] = 56,["31"] = 56,["32"] = 56,["33"] = 56,["34"] = 37,["35"] = 65,["36"] = 65,["37"] = 65,["38"] = 65,["39"] = 65,["40"] = 65,["41"] = 65,["42"] = 65,["43"] = 37,["44"] = 74,["45"] = 74,["46"] = 74,["47"] = 74,["48"] = 74,["49"] = 74,["50"] = 74,["51"] = 74,["52"] = 37,["53"] = 83,["54"] = 83,["55"] = 83,["56"] = 83,["57"] = 83,["58"] = 83,["59"] = 83,["60"] = 83,["61"] = 37,["62"] = 92,["63"] = 92,["64"] = 92,["65"] = 92,["66"] = 92,["67"] = 92,["68"] = 92,["69"] = 92,["70"] = 37,["71"] = 101,["72"] = 101,["73"] = 101,["74"] = 101,["75"] = 101,["76"] = 101,["77"] = 101,["78"] = 101,["79"] = 37,["80"] = 110,["81"] = 110,["82"] = 110,["83"] = 110,["84"] = 110,["85"] = 110,["86"] = 110,["87"] = 110,["88"] = 37,["89"] = 119,["90"] = 119,["91"] = 119,["92"] = 119,["93"] = 119,["94"] = 119,["95"] = 119,["96"] = 119,["97"] = 37,["98"] = 128,["99"] = 128,["100"] = 128,["101"] = 128,["102"] = 128,["103"] = 128,["104"] = 128,["105"] = 128,["106"] = 37,["107"] = 137,["108"] = 137,["109"] = 137,["110"] = 137,["111"] = 137,["112"] = 137,["113"] = 137,["114"] = 137,["115"] = 37,["116"] = 146,["117"] = 146,["118"] = 146,["119"] = 146,["120"] = 146,["121"] = 146,["122"] = 146,["123"] = 146,["124"] = 37,["125"] = 155,["126"] = 155,["127"] = 155,["128"] = 155,["129"] = 155,["130"] = 155,["131"] = 155,["132"] = 155,["133"] = 37,["134"] = 164,["135"] = 164,["136"] = 164,["137"] = 164,["138"] = 164,["139"] = 164,["140"] = 164,["141"] = 164,["142"] = 37,["143"] = 173,["144"] = 173,["145"] = 173,["146"] = 173,["147"] = 173,["148"] = 173,["149"] = 173,["150"] = 173,["151"] = 37,["152"] = 182,["153"] = 182,["154"] = 182,["155"] = 182,["156"] = 182,["157"] = 182,["158"] = 182,["159"] = 182,["160"] = 37,["161"] = 191,["162"] = 191,["163"] = 191,["164"] = 191,["165"] = 191,["166"] = 191,["167"] = 191,["168"] = 191,["169"] = 37,["170"] = 200,["171"] = 200,["172"] = 200,["173"] = 200,["174"] = 200,["175"] = 200,["176"] = 200,["177"] = 200,["178"] = 37,["179"] = 209,["180"] = 209,["181"] = 209,["182"] = 209,["183"] = 209,["184"] = 209,["185"] = 209,["186"] = 209,["187"] = 37,["188"] = 218,["189"] = 218,["190"] = 218,["191"] = 218,["192"] = 218,["193"] = 218,["194"] = 218,["195"] = 218,["196"] = 37,["197"] = 227,["198"] = 227,["199"] = 227,["200"] = 227,["201"] = 227,["202"] = 227,["203"] = 227,["204"] = 227,["205"] = 37,["206"] = 236,["207"] = 236,["208"] = 236,["209"] = 236,["210"] = 236,["211"] = 236,["212"] = 236,["213"] = 236,["214"] = 37,["215"] = 245,["216"] = 245,["217"] = 245,["218"] = 245,["219"] = 245,["220"] = 245,["221"] = 245,["222"] = 245,["223"] = 37,["224"] = 254,["225"] = 254,["226"] = 254,["227"] = 254,["228"] = 254,["229"] = 254,["230"] = 254,["231"] = 254,["232"] = 37,["233"] = 263,["234"] = 263,["235"] = 263,["236"] = 263,["237"] = 263,["238"] = 263,["239"] = 263,["240"] = 263,["241"] = 37,["242"] = 272,["243"] = 272,["244"] = 272,["245"] = 272,["246"] = 272,["247"] = 272,["248"] = 272,["249"] = 272,["250"] = 37,["251"] = 281,["252"] = 281,["253"] = 281,["254"] = 281,["255"] = 281,["256"] = 281,["257"] = 281,["258"] = 281,["259"] = 37,["260"] = 290,["261"] = 290,["262"] = 290,["263"] = 290,["264"] = 290,["265"] = 290,["266"] = 290,["267"] = 290,["268"] = 37,["269"] = 299,["270"] = 299,["271"] = 299,["272"] = 299,["273"] = 299,["274"] = 299,["275"] = 299,["276"] = 299,["277"] = 37,["278"] = 308,["279"] = 308,["280"] = 308,["281"] = 308,["282"] = 308,["283"] = 308,["284"] = 308,["285"] = 308,["286"] = 37,["287"] = 317,["288"] = 317,["289"] = 317,["290"] = 317,["291"] = 317,["292"] = 317,["293"] = 317,["294"] = 317,["295"] = 37,["296"] = 326,["297"] = 326,["298"] = 326,["299"] = 326,["300"] = 326,["301"] = 326,["302"] = 326,["303"] = 326,["304"] = 37,["305"] = 335,["306"] = 335,["307"] = 335,["308"] = 335,["309"] = 335,["310"] = 335,["311"] = 335,["312"] = 335,["313"] = 37,["314"] = 344,["315"] = 344,["316"] = 344,["317"] = 344,["318"] = 344,["319"] = 344,["320"] = 344,["321"] = 344,["322"] = 37,["323"] = 353,["324"] = 353,["325"] = 353,["326"] = 353,["327"] = 353,["328"] = 353,["329"] = 353,["330"] = 353,["331"] = 37,["332"] = 362,["333"] = 362,["334"] = 362,["335"] = 362,["336"] = 362,["337"] = 362,["338"] = 362,["339"] = 362,["340"] = 37,["341"] = 371,["342"] = 371,["343"] = 371,["344"] = 371,["345"] = 371,["346"] = 371,["347"] = 371,["348"] = 371,["349"] = 37,["350"] = 380,["351"] = 380,["352"] = 380,["353"] = 380,["354"] = 380,["355"] = 380,["356"] = 380,["357"] = 380,["358"] = 37,["359"] = 389,["360"] = 389,["361"] = 389,["362"] = 389,["363"] = 389,["364"] = 389,["365"] = 389,["366"] = 389,["367"] = 37,["368"] = 398,["369"] = 398,["370"] = 398,["371"] = 398,["372"] = 398,["373"] = 398,["374"] = 398,["375"] = 398,["376"] = 37,["377"] = 407,["378"] = 407,["379"] = 407,["380"] = 407,["381"] = 407,["382"] = 407,["383"] = 407,["384"] = 407,["385"] = 37,["386"] = 416,["387"] = 416,["388"] = 416,["389"] = 416,["390"] = 416,["391"] = 416,["392"] = 416,["393"] = 416,["394"] = 37,["395"] = 425,["396"] = 425,["397"] = 425,["398"] = 425,["399"] = 425,["400"] = 425,["401"] = 425,["402"] = 425,["403"] = 37,["404"] = 434,["405"] = 434,["406"] = 434,["407"] = 434,["408"] = 434,["409"] = 434,["410"] = 434,["411"] = 434,["412"] = 37,["413"] = 443,["414"] = 443,["415"] = 443,["416"] = 443,["417"] = 443,["418"] = 443,["419"] = 443,["420"] = 443,["421"] = 37,["422"] = 452,["423"] = 452,["424"] = 452,["425"] = 452,["426"] = 452,["427"] = 452,["428"] = 452,["429"] = 452,["430"] = 37,["431"] = 461,["432"] = 461,["433"] = 461,["434"] = 461,["435"] = 461,["436"] = 461,["437"] = 461,["438"] = 461,["439"] = 37,["440"] = 470,["441"] = 470,["442"] = 470,["443"] = 470,["444"] = 470,["445"] = 470,["446"] = 470,["447"] = 470,["448"] = 37,["449"] = 479,["450"] = 479,["451"] = 479,["452"] = 479,["453"] = 479,["454"] = 479,["455"] = 479,["456"] = 479,["457"] = 37,["458"] = 488,["459"] = 488,["460"] = 488,["461"] = 488,["462"] = 488,["463"] = 488,["464"] = 488,["465"] = 488,["466"] = 37,["467"] = 497,["468"] = 497,["469"] = 497,["470"] = 497,["471"] = 497,["472"] = 497,["473"] = 497,["474"] = 497,["475"] = 37,["476"] = 506,["477"] = 506,["478"] = 506,["479"] = 506,["480"] = 506,["481"] = 506,["482"] = 506,["483"] = 506,["484"] = 37,["485"] = 515,["486"] = 515,["487"] = 515,["488"] = 515,["489"] = 515,["490"] = 515,["491"] = 515,["492"] = 515,["493"] = 37,["494"] = 524,["495"] = 524,["496"] = 524,["497"] = 524,["498"] = 524,["499"] = 524,["500"] = 524,["501"] = 524,["502"] = 37,["503"] = 533,["504"] = 533,["505"] = 533,["506"] = 533,["507"] = 533,["508"] = 533,["509"] = 533,["510"] = 533,["511"] = 37,["512"] = 542,["513"] = 542,["514"] = 542,["515"] = 542,["516"] = 542,["517"] = 542,["518"] = 542,["519"] = 542,["520"] = 37,["521"] = 551,["522"] = 551,["523"] = 551,["524"] = 551,["525"] = 551,["526"] = 551,["527"] = 551,["528"] = 551,["529"] = 37,["530"] = 560,["531"] = 560,["532"] = 560,["533"] = 560,["534"] = 560,["535"] = 560,["536"] = 560,["537"] = 560,["538"] = 37,["539"] = 569,["540"] = 569,["541"] = 569,["542"] = 569,["543"] = 569,["544"] = 569,["545"] = 569,["546"] = 569,["547"] = 37,["548"] = 578,["549"] = 578,["550"] = 578,["551"] = 578,["552"] = 578,["553"] = 578,["554"] = 578,["555"] = 578,["556"] = 37,["557"] = 587,["558"] = 587,["559"] = 587,["560"] = 587,["561"] = 587,["562"] = 587,["563"] = 587,["564"] = 587,["565"] = 37,["566"] = 596,["567"] = 596,["568"] = 596,["569"] = 596,["570"] = 596,["571"] = 596,["572"] = 596,["573"] = 596,["574"] = 37,["575"] = 605,["576"] = 605,["577"] = 605,["578"] = 605,["579"] = 605,["580"] = 605,["581"] = 605,["582"] = 605,["583"] = 37,["584"] = 614,["585"] = 614,["586"] = 614,["587"] = 614,["588"] = 614,["589"] = 614,["590"] = 614,["591"] = 614,["592"] = 37,["593"] = 623,["594"] = 623,["595"] = 623,["596"] = 623,["597"] = 623,["598"] = 623,["599"] = 623,["600"] = 623,["601"] = 37,["602"] = 37,["603"] = 633,["604"] = 637,["605"] = 639,["606"] = 640,["607"] = 641});
local ____exports = {}
local ____ActorTypeUtil = require("solar.solar-common.actor.util.ActorTypeUtil")
local ActorTypeUtil = ____ActorTypeUtil.default
____exports.data = {
    {
        id = "木船设计图·射速",
        class = "主炮存档B",
        name = "木船设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\木船-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "水手号设计图·射速",
        class = "主炮存档B",
        name = "水手号设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\水手号-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "水手号·改设计图·射速",
        class = "主炮存档B",
        name = "水手号·改设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\水手号-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "铁达尼号设计图·射速",
        class = "主炮存档B",
        name = "铁达尼号设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\铁达尼号（力）-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "泰坦尼克号设计图·射速",
        class = "主炮存档B",
        name = "泰坦尼克号设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\铁达尼号（力）-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "黑珍珠号设计图·射速",
        class = "主炮存档B",
        name = "黑珍珠号设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\黑珍珠号（敏）-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "黑色幽灵号设计图·射速",
        class = "主炮存档B",
        name = "黑色幽灵号设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\黑色幽灵号（敏）-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "桑尼号设计图·射速",
        class = "主炮存档B",
        name = "桑尼号设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\桑尼号（智）-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "阳光桑尼号设计图·射速",
        class = "主炮存档B",
        name = "阳光桑尼号设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\阳光桑尼号（智）-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "死神号设计图·射速",
        class = "主炮存档B",
        name = "死神号设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\死神号（智）-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "歼星号设计图·射速",
        class = "主炮存档B",
        name = "歼星号设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\歼星号（力）-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "毁灭号设计图·射速",
        class = "主炮存档B",
        name = "毁灭号设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\毁灭号石像鬼-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "嗜血号设计图·射速",
        class = "主炮存档B",
        name = "嗜血号设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\嗜血号-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "瘟疫号设计图·射速",
        class = "主炮存档B",
        name = "瘟疫号设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\瘟疫号（力）-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "蛮族号设计图·射速",
        class = "主炮存档B",
        name = "蛮族号设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\蛮族号-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "海皇波塞冬设计图·射速",
        class = "主炮存档B",
        name = "海皇波塞冬设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\海皇波塞冬（力）-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "深海之女设计图·射速",
        class = "主炮存档B",
        name = "深海之女设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\深海之女-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "武装直升机设计图·射速",
        class = "主炮存档B",
        name = "武装直升机设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\武装直升机-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "秃鹫王设计图·射速",
        class = "主炮存档B",
        name = "秃鹫王设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\秃鹫王-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "商船设计图·射速",
        class = "主炮存档B",
        name = "商船设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\商船（智力）-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "缅电船设计图·射速",
        class = "主炮存档B",
        name = "缅电船设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\缅电船（力量）-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "蓝色幻影设计图·射速",
        class = "主炮存档B",
        name = "蓝色幻影设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\蓝色幻影-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "魔法船设计图·射速",
        class = "主炮存档B",
        name = "魔法船设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\魔法船（智力）-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "顽石号设计图·射速",
        class = "主炮存档B",
        name = "顽石号设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\顽石号（力量）-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "巡洋舰设计图·射速",
        class = "主炮存档B",
        name = "巡洋舰设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\巡洋舰-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "猩红之女设计图·射速",
        class = "主炮存档B",
        name = "猩红之女设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\猩红之女-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "光明号设计图·射速",
        class = "主炮存档B",
        name = "光明号设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\光明号-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "潜艇设计图·射速",
        class = "主炮存档B",
        name = "潜艇设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\潜艇（敏捷）-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "天使号设计图·射速",
        class = "主炮存档B",
        name = "天使号设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\天使号（智力）-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "船长号设计图·射速",
        class = "主炮存档B",
        name = "船长号设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\船长号（力量）-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "安妮女王复仇号设计图·射速",
        class = "主炮存档B",
        name = "安妮女王复仇号设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\安妮女王复仇号（力量）-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "冒险号设计图·射速",
        class = "主炮存档B",
        name = "冒险号设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\冒险号（敏捷）-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "皇家宝藏号设计图·射速",
        class = "主炮存档B",
        name = "皇家宝藏号设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\皇家宝藏号（智力）-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "雷雨号主炮设计图·射速",
        class = "主炮存档B",
        name = "雷雨号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\雷雨号-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "狂风呼啸号主炮设计图·射速",
        class = "主炮存档B",
        name = "狂风呼啸号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\狂风呼啸号-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "刀扇号主炮设计图·射速",
        class = "主炮存档B",
        name = "刀扇号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\刀扇号-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "最强攻击号主炮设计图·射速",
        class = "主炮存档B",
        name = "最强攻击号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\最强攻击号-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "兽族兵营号主炮设计图·射速",
        class = "主炮存档B",
        name = "兽族兵营号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\兽族兵营号-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "人族兵营号主炮设计图·射速",
        class = "主炮存档B",
        name = "人族兵营号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\人族兵营号-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "暗夜精灵号主炮设计图·射速",
        class = "主炮存档B",
        name = "暗夜精灵号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\暗夜精灵号（敏捷）-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "不死亡灵号主炮设计图·射速",
        class = "主炮存档B",
        name = "不死亡灵号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\不死亡灵号-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "科多号主炮设计图·射速",
        class = "主炮存档B",
        name = "科多号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\科多号-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "冰霜巨龙主炮设计图·射速",
        class = "主炮存档B",
        name = "冰霜巨龙主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\冰霜巨龙-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "黑龙主炮设计图·射速",
        class = "主炮存档B",
        name = "黑龙主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\黑龙-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "神之号主炮设计图·射速",
        class = "主炮存档B",
        name = "神之号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\神之号-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "剑圣主炮设计图·射速",
        class = "主炮存档B",
        name = "剑圣主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "船图标\\剑圣-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "团结号主炮设计图·射速",
        class = "主炮存档B",
        name = "团结号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "图标\\团结号等\\团结号01.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "遥遥领先号主炮设计图·射速",
        class = "主炮存档B",
        name = "遥遥领先号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "图标\\团结号等\\遥遥领先号01.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "满天繁星号主炮设计图·射速",
        class = "主炮存档B",
        name = "满天繁星号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "图标\\团结号等\\满天繁星号01.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "旋转飞轮号主炮设计图·射速",
        class = "主炮存档B",
        name = "旋转飞轮号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "图标\\团结号等\\旋转飞轮号01.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "萧炎号主炮设计图·射速",
        class = "主炮存档B",
        name = "萧炎号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "图标\\团结号等\\萧炎号01.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "练习生主炮设计图·射速",
        class = "主炮存档B",
        name = "练习生主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "单位\\练习生\\练习生主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "吞吞号主炮设计图·射速",
        class = "主炮存档B",
        name = "吞吞号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "单位\\新加英雄2\\吞吞-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "步惊云号主炮设计图·射速",
        class = "主炮存档B",
        name = "步惊云号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "单位\\新加英雄2\\步惊云-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "吓死个人号主炮设计图·射速",
        class = "主炮存档B",
        name = "吓死个人号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "单位\\新加英雄2\\吓死个人-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "以杀证道号主炮设计图·射速",
        class = "主炮存档B",
        name = "以杀证道号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "单位\\新加英雄2\\以杀证道-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "烧起来了号主炮设计图·射速",
        class = "主炮存档B",
        name = "烧起来了号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "单位\\新加英雄2\\烧起来了-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "克苏鲁号主炮设计图·射速",
        class = "主炮存档B",
        name = "克苏鲁号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "单位\\新加英雄2\\克苏鲁-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "无始大帝号主炮设计图·射速",
        class = "主炮存档B",
        name = "无始大帝号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "单位\\新加英雄2\\元始大帝-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "大佬体验号主炮设计图·射速",
        class = "主炮存档B",
        name = "大佬体验号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "单位\\新加英雄2\\大佬体验-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "极寒号主炮设计图·射速",
        class = "主炮存档B",
        name = "极寒号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "单位\\新加英雄2\\极寒-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "魂斗罗号主炮设计图·射速",
        class = "主炮存档B",
        name = "魂斗罗号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "单位\\新加英雄2\\魂斗罗-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "飞起来号主炮设计图·射速",
        class = "主炮存档B",
        name = "飞起来号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "单位\\新加英雄3\\飞起来-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "一袋米扛几楼号主炮设计图·射速",
        class = "主炮存档B",
        name = "一袋米扛几楼号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "单位\\新加英雄3\\一袋米抗几号楼-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "搞事情号主炮设计图·射速",
        class = "主炮存档B",
        name = "搞事情号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "单位\\新加英雄3\\搞事情-主炮.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "不要停下来号主炮设计图·射速",
        class = "主炮存档B",
        name = "不要停下来号主炮设计图·射速",
        value = 0.2,
        describe = "主炮射速+20%",
        icon = "单位\\新加英雄3\\不要停下来-主炮.blp",
        uiShowType = "通用图标面板"
    }
}
____exports["d_主炮存档B"] = ____exports.data
function ____exports.default(self)
    for ____, datum in ipairs(____exports.data) do
        if datum.id then
            ActorTypeUtil:registerActorType(datum)
        end
    end
end
return ____exports
