local ____lualib = require("lualib_bundle")
local __TS__SourceMapTraceBack = ____lualib.__TS__SourceMapTraceBack
__TS__SourceMapTraceBack(debug.getinfo(1).short_src, {["5"] = 5,["6"] = 5,["7"] = 6,["8"] = 6,["9"] = 7,["10"] = 7,["11"] = 46,["12"] = 47,["13"] = 47,["14"] = 47,["15"] = 47,["16"] = 47,["17"] = 47,["18"] = 47,["19"] = 47,["20"] = 47,["21"] = 46,["22"] = 57,["23"] = 57,["24"] = 57,["25"] = 57,["26"] = 57,["27"] = 57,["28"] = 57,["29"] = 57,["30"] = 57,["31"] = 57,["32"] = 57,["33"] = 57,["34"] = 57,["35"] = 57,["36"] = 46,["37"] = 74,["38"] = 74,["39"] = 74,["40"] = 74,["41"] = 74,["42"] = 74,["43"] = 74,["44"] = 74,["45"] = 74,["46"] = 74,["47"] = 74,["48"] = 74,["49"] = 74,["50"] = 74,["51"] = 46,["52"] = 91,["53"] = 91,["54"] = 91,["55"] = 91,["56"] = 91,["57"] = 91,["58"] = 91,["59"] = 91,["60"] = 91,["61"] = 91,["62"] = 91,["63"] = 91,["64"] = 91,["65"] = 91,["66"] = 46,["67"] = 108,["68"] = 108,["69"] = 108,["70"] = 108,["71"] = 108,["72"] = 108,["73"] = 108,["74"] = 108,["75"] = 108,["76"] = 108,["77"] = 108,["78"] = 108,["79"] = 108,["80"] = 108,["81"] = 46,["82"] = 125,["83"] = 125,["84"] = 125,["85"] = 125,["86"] = 125,["87"] = 125,["88"] = 125,["89"] = 125,["90"] = 125,["91"] = 125,["92"] = 125,["93"] = 125,["94"] = 125,["95"] = 125,["96"] = 46,["97"] = 142,["98"] = 142,["99"] = 142,["100"] = 142,["101"] = 142,["102"] = 142,["103"] = 142,["104"] = 142,["105"] = 142,["106"] = 142,["107"] = 142,["108"] = 142,["109"] = 142,["110"] = 142,["111"] = 46,["112"] = 159,["113"] = 159,["114"] = 159,["115"] = 159,["116"] = 159,["117"] = 159,["118"] = 159,["119"] = 159,["120"] = 159,["121"] = 159,["122"] = 159,["123"] = 159,["124"] = 159,["125"] = 159,["126"] = 46,["127"] = 176,["128"] = 176,["129"] = 176,["130"] = 176,["131"] = 176,["132"] = 176,["133"] = 176,["134"] = 176,["135"] = 176,["136"] = 176,["137"] = 176,["138"] = 176,["139"] = 176,["140"] = 176,["141"] = 46,["142"] = 193,["143"] = 193,["144"] = 193,["145"] = 193,["146"] = 193,["147"] = 193,["148"] = 193,["149"] = 193,["150"] = 193,["151"] = 193,["152"] = 193,["153"] = 193,["154"] = 193,["155"] = 193,["156"] = 46,["157"] = 210,["158"] = 210,["159"] = 210,["160"] = 210,["161"] = 210,["162"] = 210,["163"] = 210,["164"] = 210,["165"] = 210,["166"] = 210,["167"] = 210,["168"] = 210,["169"] = 210,["170"] = 210,["171"] = 46,["172"] = 227,["173"] = 227,["174"] = 227,["175"] = 227,["176"] = 227,["177"] = 227,["178"] = 227,["179"] = 227,["180"] = 227,["181"] = 227,["182"] = 227,["183"] = 227,["184"] = 227,["185"] = 227,["186"] = 46,["187"] = 242,["188"] = 242,["189"] = 242,["190"] = 242,["191"] = 242,["192"] = 242,["193"] = 242,["194"] = 242,["195"] = 242,["196"] = 242,["197"] = 242,["198"] = 242,["199"] = 242,["200"] = 242,["201"] = 46,["202"] = 259,["203"] = 259,["204"] = 259,["205"] = 259,["206"] = 259,["207"] = 259,["208"] = 259,["209"] = 259,["210"] = 259,["211"] = 259,["212"] = 259,["213"] = 259,["214"] = 259,["215"] = 259,["216"] = 46,["217"] = 276,["218"] = 276,["219"] = 276,["220"] = 276,["221"] = 276,["222"] = 276,["223"] = 276,["224"] = 276,["225"] = 276,["226"] = 276,["227"] = 276,["228"] = 276,["229"] = 276,["230"] = 276,["231"] = 46,["232"] = 293,["233"] = 293,["234"] = 293,["235"] = 293,["236"] = 293,["237"] = 293,["238"] = 293,["239"] = 293,["240"] = 293,["241"] = 293,["242"] = 293,["243"] = 293,["244"] = 293,["245"] = 293,["246"] = 46,["247"] = 310,["248"] = 310,["249"] = 310,["250"] = 310,["251"] = 310,["252"] = 310,["253"] = 310,["254"] = 310,["255"] = 310,["256"] = 310,["257"] = 310,["258"] = 310,["259"] = 310,["260"] = 310,["261"] = 46,["262"] = 328,["263"] = 328,["264"] = 328,["265"] = 328,["266"] = 328,["267"] = 328,["268"] = 328,["269"] = 328,["270"] = 328,["271"] = 328,["272"] = 328,["273"] = 328,["274"] = 328,["275"] = 328,["276"] = 46,["277"] = 346,["278"] = 346,["279"] = 346,["280"] = 346,["281"] = 346,["282"] = 346,["283"] = 346,["284"] = 346,["285"] = 346,["286"] = 346,["287"] = 346,["288"] = 346,["289"] = 346,["290"] = 346,["291"] = 46,["292"] = 364,["293"] = 364,["294"] = 364,["295"] = 364,["296"] = 364,["297"] = 364,["298"] = 364,["299"] = 364,["300"] = 364,["301"] = 364,["302"] = 364,["303"] = 364,["304"] = 364,["305"] = 364,["306"] = 46,["307"] = 382,["308"] = 382,["309"] = 382,["310"] = 382,["311"] = 382,["312"] = 382,["313"] = 382,["314"] = 389,["315"] = 389,["316"] = 389,["317"] = 389,["318"] = 389,["319"] = 389,["320"] = 382,["321"] = 382,["322"] = 382,["323"] = 382,["324"] = 382,["325"] = 382,["326"] = 382,["327"] = 46,["328"] = 46,["329"] = 404,["330"] = 408,["331"] = 410,["332"] = 411,["333"] = 412,["336"] = 415,["337"] = 415,["338"] = 415,["339"] = 416,["340"] = 417,["341"] = 418,["344"] = 415,["345"] = 415});
local ____exports = {}
local ____ActorTypeUtil = require("solar.solar-common.actor.util.ActorTypeUtil")
local ActorTypeUtil = ____ActorTypeUtil.default
local _____5E73_53F0_5B58_6863_7B49_5730_56FE_76F8_5173_5956_52B1 = require("state.存档.平台存档等地图相关奖励")
local _____5E73_53F0_5B58_6863_7B49_5730_56FE_76F8_5173_5956_52B1 = _____5E73_53F0_5B58_6863_7B49_5730_56FE_76F8_5173_5956_52B1.default
local ____BaseUtil = require("solar.solar-common.util.BaseUtil")
local BaseUtil = ____BaseUtil.default
____exports.data = {
    {
        id = "探索积分",
        class = "探索点兑换",
        name = "探索积分",
        requireKey = "Itsjf",
        requireValMin = 1,
        describe = "在深度海域获得的探索积分可以在这里进行分配到需要的加强方位，然后左键点击探索积分是总确认。右键点击是撤销。其他方位图标左键是+1 右键是-1。",
        icon = "图标\\深海存档\\探索积分.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "力量加成",
        class = "探索点兑换",
        name = "力量加成",
        requireKey = "dh_1",
        requireValMin = 1,
        rewardKey = "加属性",
        rewardVal = {strength_p = 0.01},
        ["数量叠加"] = true,
        ["显示数量"] = false,
        ["兑换需要探索点"] = 50,
        describe = "力量加成1%",
        icon = "图标\\深海存档\\力量加成.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "敏捷加成",
        class = "探索点兑换",
        name = "敏捷加成",
        requireKey = "dh_2",
        requireValMin = 1,
        rewardKey = "加属性",
        rewardVal = {agility_p = 0.01},
        ["数量叠加"] = true,
        ["显示数量"] = false,
        ["兑换需要探索点"] = 50,
        describe = "敏捷加成1%",
        icon = "图标\\深海存档\\敏捷加成.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "智力加成",
        class = "探索点兑换",
        name = "智力加成",
        requireKey = "dh_3",
        requireValMin = 1,
        rewardKey = "加属性",
        rewardVal = {intelligence_p = 0.01},
        ["数量叠加"] = true,
        ["显示数量"] = false,
        ["兑换需要探索点"] = 50,
        describe = "智力加成1%",
        icon = "图标\\深海存档\\智力加成.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "攻击加成",
        class = "探索点兑换",
        name = "攻击加成",
        requireKey = "dh_4",
        requireValMin = 1,
        rewardKey = "加属性",
        rewardVal = {attack_p = 0.01},
        ["数量叠加"] = true,
        ["显示数量"] = false,
        ["兑换需要探索点"] = 50,
        describe = "攻击加成1%",
        icon = "图标\\深海存档\\攻击加成.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "伤害加成",
        class = "探索点兑换",
        name = "伤害加成",
        requireKey = "dh_5",
        requireValMin = 1,
        rewardKey = "加属性",
        rewardVal = {damage_increased = 0.01},
        ["数量叠加"] = true,
        ["显示数量"] = false,
        ["兑换需要探索点"] = 50,
        describe = "伤害加成1%",
        icon = "图标\\深海存档\\伤害加成.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "初始力量",
        class = "探索点兑换",
        name = "初始力量",
        requireKey = "dh_6",
        requireValMin = 1,
        rewardKey = "加属性",
        rewardVal = {strength = 1},
        ["数量叠加"] = true,
        ["显示数量"] = false,
        ["兑换需要探索点"] = 15,
        describe = "初始力量1",
        icon = "图标\\深海存档\\初始力量.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "初始敏捷",
        class = "探索点兑换",
        name = "初始敏捷",
        requireKey = "dh_7",
        requireValMin = 1,
        rewardKey = "加属性",
        rewardVal = {agility = 1},
        ["数量叠加"] = true,
        ["显示数量"] = false,
        ["兑换需要探索点"] = 15,
        describe = "初始敏捷1",
        icon = "图标\\深海存档\\初始敏捷.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "初始智力",
        class = "探索点兑换",
        name = "初始智力",
        requireKey = "dh_8",
        requireValMin = 1,
        rewardKey = "加属性",
        rewardVal = {intelligence = 1},
        ["数量叠加"] = true,
        ["显示数量"] = false,
        ["兑换需要探索点"] = 15,
        describe = "初始智力1",
        icon = "图标\\深海存档\\初始智力.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "初始攻击",
        class = "探索点兑换",
        name = "初始攻击",
        requireKey = "dh_9",
        requireValMin = 1,
        rewardKey = "加属性",
        rewardVal = {attack = 1},
        ["数量叠加"] = true,
        ["显示数量"] = false,
        ["兑换需要探索点"] = 15,
        describe = "初始攻击2",
        icon = "图标\\深海存档\\初始攻击.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "初始护甲",
        class = "探索点兑换",
        name = "初始护甲",
        requireKey = "dh_10",
        requireValMin = 1,
        rewardKey = "加属性",
        rewardVal = {def = 0.5},
        ["数量叠加"] = true,
        ["显示数量"] = false,
        ["兑换需要探索点"] = 15,
        describe = "初始护甲0.5",
        icon = "图标\\深海存档\\初始护甲.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "初始金币",
        class = "探索点兑换",
        name = "初始金币",
        requireKey = "dh_11",
        requireValMin = 1,
        rewardKey = "加金币",
        rewardVal = 50,
        ["数量叠加"] = true,
        ["显示数量"] = false,
        ["兑换需要探索点"] = 100,
        describe = "初始金币50",
        icon = "图标\\深海存档\\初始金币.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "金币加成",
        class = "探索点兑换",
        name = "金币加成",
        requireKey = "dh_12",
        requireValMin = 1,
        rewardKey = "加属性",
        rewardVal = {earn_gold_p = 0.01},
        ["数量叠加"] = true,
        ["显示数量"] = false,
        ["兑换需要探索点"] = 50,
        describe = "金币加成1%",
        icon = "图标\\深海存档\\金币加成.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "航速",
        class = "探索点兑换",
        name = "航速",
        requireKey = "dh_13",
        requireValMin = 1,
        rewardKey = "加属性",
        rewardVal = {move_speed = 5},
        ["数量叠加"] = true,
        ["显示数量"] = false,
        ["兑换需要探索点"] = 100,
        describe = "航速5",
        icon = "图标\\深海存档\\航速.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "BOSS伤害",
        class = "探索点兑换",
        name = "BOSS伤害",
        requireKey = "dh_14",
        requireValMin = 1,
        rewardKey = "加属性",
        rewardVal = {["英雄伤害"] = 0.01},
        ["数量叠加"] = true,
        ["显示数量"] = false,
        ["兑换需要探索点"] = 100,
        describe = "BOSS伤害1%",
        icon = "图标\\深海存档\\BOSS伤害.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "初级探险者",
        class = "探索点兑换",
        name = "初级探险者",
        requireKey = "dh_15",
        requireValMin = 1,
        rewardKey = "加属性",
        rewardVal = {full_property = 10},
        ["数量叠加"] = true,
        ["显示数量"] = false,
        ["兑换需要探索点"] = 200,
        describe = "初级探险者：初始全属性+10",
        icon = "图标\\深海存档\\初级探险者.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "中级探险者",
        class = "探索点兑换",
        name = "中级探险者",
        requireKey = "dh_16",
        requireValMin = 1,
        rewardKey = "加属性",
        rewardVal = {full_property = 10, ["初始金币"] = 50},
        ["数量叠加"] = true,
        ["显示数量"] = false,
        ["兑换需要探索点"] = 500,
        describe = "中级探险者：初始全属性+10，初始金币+50",
        icon = "图标\\深海存档\\中级探险者.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "高级探险者",
        class = "探索点兑换",
        name = "高级探险者",
        requireKey = "dh_17",
        requireValMin = 1,
        rewardKey = "加属性",
        rewardVal = {full_property = 10, ["吞天石吞噬上限"] = 1},
        ["数量叠加"] = true,
        ["显示数量"] = false,
        ["兑换需要探索点"] = 1000,
        describe = "神话探险家：初始全属性+10，吞天石吞噬上限+1",
        icon = "图标\\深海存档\\高级探险者.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "顶级探险者",
        class = "探索点兑换",
        name = "顶级探险者",
        requireKey = "dh_18",
        requireValMin = 1,
        rewardKey = "加属性",
        rewardVal = {full_property = 10, ["吞噬船长上限"] = 1},
        ["数量叠加"] = true,
        ["显示数量"] = false,
        ["兑换需要探索点"] = 2000,
        describe = "顶级探险者：初始全属性+10，吞噬船长上限+1",
        icon = "图标\\深海存档\\顶级探险者.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "传奇探险家",
        class = "探索点兑换",
        name = "传奇探险家",
        requireKey = "dh_19",
        requireValMin = 1,
        rewardKey = "加属性",
        rewardVal = {full_property = 10, ["初始船长信件"] = 1},
        ["数量叠加"] = true,
        ["显示数量"] = false,
        ["兑换需要探索点"] = 3000,
        describe = "传奇探险家：初始全属性+10，初始船长信件+1",
        icon = "图标\\深海存档\\传奇探险家.blp",
        uiShowType = "通用图标面板"
    },
    {
        id = "神话探险家",
        class = "探索点兑换",
        name = "神话探险家",
        requireKey = "dh_20",
        requireValMin = 1,
        rewardKey = "加属性",
        rewardVal = {
            full_property = 10,
            add_strength_on_pers = 1,
            add_agility_on_pers = 1,
            add_intelligence_on_pers = 1,
            ["初始吞天石"] = 1
        },
        ["数量叠加"] = true,
        ["显示数量"] = false,
        ["兑换需要探索点"] = 5000,
        describe = "高级探险者：初始全属性+10，每秒全属性+1，初始吞天石+1",
        icon = "图标\\深海存档\\神话探险家.blp",
        uiShowType = "通用图标面板"
    }
}
____exports["d_兑换初始属性存档"] = ____exports.data
function ____exports.default(self)
    for ____, datum in ipairs(____exports.data) do
        if datum.id then
            ActorTypeUtil:registerActorType(datum)
        end
    end
    BaseUtil.runLater(
        0.1,
        function()
            for ____, datum in ipairs(____exports.data) do
                if datum.id then
                    _____5E73_53F0_5B58_6863_7B49_5730_56FE_76F8_5173_5956_52B1:distributeRewards(datum)
                end
            end
        end
    )
end
return ____exports
