local ____lualib = require("lualib_bundle")
local __TS__Class = ____lualib.__TS__Class
local __TS__New = ____lualib.__TS__New
local __TS__SourceMapTraceBack = ____lualib.__TS__SourceMapTraceBack
__TS__SourceMapTraceBack(debug.getinfo(1).short_src, {["7"] = 1,["8"] = 1,["9"] = 2,["10"] = 2,["11"] = 3,["12"] = 3,["13"] = 4,["14"] = 4,["15"] = 5,["16"] = 5,["17"] = 6,["18"] = 6,["19"] = 7,["20"] = 7,["21"] = 8,["22"] = 8,["23"] = 9,["24"] = 9,["25"] = 10,["26"] = 10,["27"] = 11,["28"] = 11,["29"] = 12,["30"] = 12,["31"] = 13,["32"] = 13,["33"] = 14,["34"] = 14,["35"] = 15,["36"] = 15,["37"] = 16,["38"] = 16,["39"] = 17,["40"] = 17,["41"] = 18,["42"] = 18,["43"] = 19,["44"] = 19,["45"] = 20,["46"] = 20,["47"] = 21,["48"] = 21,["49"] = 22,["50"] = 22,["51"] = 23,["52"] = 23,["53"] = 24,["54"] = 24,["55"] = 25,["56"] = 25,["57"] = 26,["58"] = 26,["59"] = 27,["60"] = 27,["61"] = 28,["62"] = 28,["63"] = 29,["64"] = 29,["65"] = 31,["66"] = 31,["67"] = 31,["69"] = 36,["70"] = 37,["71"] = 38,["72"] = 41,["73"] = 42,["74"] = 43,["75"] = 44,["76"] = 45,["77"] = 46,["78"] = 53,["79"] = 54,["80"] = 55,["81"] = 57,["82"] = 58,["83"] = 59,["84"] = 60,["85"] = 61,["86"] = 62,["87"] = 65,["88"] = 65,["89"] = 65,["90"] = 67,["91"] = 68,["92"] = 69,["93"] = 70,["94"] = 72,["95"] = 65,["96"] = 65,["97"] = 74,["98"] = 74,["99"] = 74,["100"] = 76,["101"] = 77,["102"] = 78,["103"] = 78,["104"] = 78,["105"] = 79,["106"] = 79,["107"] = 80,["108"] = 79,["109"] = 79,["110"] = 79,["111"] = 82,["112"] = 82,["113"] = 83,["114"] = 82,["115"] = 82,["116"] = 82,["117"] = 82,["118"] = 86,["119"] = 89,["120"] = 78,["121"] = 78,["122"] = 74,["123"] = 74,["124"] = 34});
local ____exports = {}
local _____7EA2_8272_89E6_624B_7684_7075_9B42_788E_7247 = require("state.存档.红色触手的灵魂碎片")
local _____7EA2_8272_89E6_624B_7684_7075_9B42_788E_7247 = _____7EA2_8272_89E6_624B_7684_7075_9B42_788E_7247.default
local _____6DF1_6D77_5DE8_517D_7684_7075_9B42_788E_7247 = require("state.存档.深海巨兽的灵魂碎片")
local _____6DF1_6D77_5DE8_517D_7684_7075_9B42_788E_7247 = _____6DF1_6D77_5DE8_517D_7684_7075_9B42_788E_7247.default
local _____5927_526F_7684_7075_9B42_788E_7247 = require("state.存档.大副的灵魂碎片")
local _____5927_526F_7684_7075_9B42_788E_7247 = _____5927_526F_7684_7075_9B42_788E_7247.default
local _____53E4_8001_8005_7684_7075_9B42_788E_7247 = require("state.存档.古老者的灵魂碎片")
local _____53E4_8001_8005_7684_7075_9B42_788E_7247 = _____53E4_8001_8005_7684_7075_9B42_788E_7247.default
local _____795E_8BDD_6743_67C4 = require("state.存档.神话权柄")
local _____795E_8BDD_6743_67C4 = _____795E_8BDD_6743_67C4.default
local _____5730_56FE_7B49_7EA7_5956_52B1_63D0_793A = require("state.存档.地图等级奖励提示")
local _____5730_56FE_7B49_7EA7_5956_52B1_63D0_793A = _____5730_56FE_7B49_7EA7_5956_52B1_63D0_793A.default
local _____5730_56FE_7B49_7EA7_5956_52B1 = require("xlsx.存档.地图等级奖励")
local _____5730_56FE_7B49_7EA7_5956_52B1 = _____5730_56FE_7B49_7EA7_5956_52B1.default
local _____5E73_53F0_8BBA_575B_70B9_8D5E_76F8_5173_5956_52B1 = require("xlsx.存档.平台论坛点赞相关奖励")
local _____5E73_53F0_8BBA_575B_70B9_8D5E_76F8_5173_5956_52B1 = _____5E73_53F0_8BBA_575B_70B9_8D5E_76F8_5173_5956_52B1.default
local _____901A_5173_5956_52B1 = require("xlsx.存档.通关奖励")
local _____901A_5173_5956_52B1 = _____901A_5173_5956_52B1.default
local _____51FB_6740BOSS_88C5_5907_5B58_6863 = require("xlsx.存档.击杀BOSS装备存档")
local _____51FB_6740BOSS_88C5_5907_5B58_6863 = _____51FB_6740BOSS_88C5_5907_5B58_6863.default
local _____6DF1_5EA6_6D77_57DF_5B58_6863 = require("xlsx.存档.深度海域存档")
local _____6DF1_5EA6_6D77_57DF_5B58_6863 = _____6DF1_5EA6_6D77_57DF_5B58_6863.default
local _____5386_53F2_4E2D_7684_6218_8230_788E_7247 = require("xlsx.存档.历史中的战舰碎片")
local _____5386_53F2_4E2D_7684_6218_8230_788E_7247 = _____5386_53F2_4E2D_7684_6218_8230_788E_7247.default
local _____5151_6362_521D_59CB_5C5E_6027_5B58_6863 = require("xlsx.存档.兑换初始属性存档")
local _____5151_6362_521D_59CB_5C5E_6027_5B58_6863 = _____5151_6362_521D_59CB_5C5E_6027_5B58_6863.default
local _____795E_8BDD_6743_67C4_7D2F_8BA1_89E3_9501 = require("xlsx.存档.神话权柄累计解锁")
local _____795E_8BDD_6743_67C4_7D2F_8BA1_89E3_9501 = _____795E_8BDD_6743_67C4_7D2F_8BA1_89E3_9501.default
local _____5B58_6863_5206_7C7B_91CD_7EC4 = require("state.存档.存档分类重组")
local _____5B58_6863_5206_7C7B_91CD_7EC4 = _____5B58_6863_5206_7C7B_91CD_7EC4.default
local ____BaseUtil = require("solar.solar-common.util.BaseUtil")
local BaseUtil = ____BaseUtil.default
local _____6218_8230_788E_7247_5151_6362 = require("state.存档.战舰碎片兑换")
local _____6218_8230_788E_7247_5151_6362 = _____6218_8230_788E_7247_5151_6362.default
local _____63A2_7D22_70B9_5151_6362 = require("state.存档.探索点兑换")
local _____63A2_7D22_70B9_5151_6362 = _____63A2_7D22_70B9_5151_6362.default
local _____5B58_6863_5C5E_6027 = require("attribute.玩家属性.存档属性")
local _____5B58_6863_5C5E_6027 = _____5B58_6863_5C5E_6027.default
local _____5168_670D_6392_884C_699C = require("state.存档.全服排行榜")
local _____5168_670D_6392_884C_699C = _____5168_670D_6392_884C_699C.default
local ____QQ_7FA4_52A0_7FA4_94FE_63A5 = require("state.存档.QQ群加群链接")
local ____QQ_7FA4_52A0_7FA4_94FE_63A5 = ____QQ_7FA4_52A0_7FA4_94FE_63A5.default
local _____5546_57CE = require("xlsx.商城.商城")
local _____5546_57CE = _____5546_57CE.default
local _____725B_5E01_9053_5177 = require("state.商城.牛币道具")
local _____725B_5E01_9053_5177 = _____725B_5E01_9053_5177.default
local ____ActorTypeUtil = require("solar.solar-common.actor.util.ActorTypeUtil")
local ActorTypeUtil = ____ActorTypeUtil.default
local _____9B54_6539_9053_5177 = require("state.商城.魔改道具")
local _____9B54_6539_9053_5177 = _____9B54_6539_9053_5177.default
local _____4E3B_70AE_5B58_6863ABC = require("state.存档.主炮存档ABC")
local _____4E3B_70AE_5B58_6863ABC = _____4E3B_70AE_5B58_6863ABC.default
local _____5B58_6863_83B7_53D6 = require("state.存档.存档获取")
local _____5B58_6863_83B7_53D6 = _____5B58_6863_83B7_53D6.default
local _____5B58_6863_67E5_8BE2_6307_4EE4 = require("state.存档.存档查询指令")
local _____5B58_6863_67E5_8BE2_6307_4EE4 = _____5B58_6863_67E5_8BE2_6307_4EE4.default
local _____73A9_5BB6_8BBE_7F6E_7279_6548_7B49_5F00_5173 = require("state.系统.玩家设置特效等开关")
local _____73A9_5BB6_8BBE_7F6E_7279_6548_7B49_5F00_5173 = _____73A9_5BB6_8BBE_7F6E_7279_6548_7B49_5F00_5173.default
____exports.default = __TS__Class()
local _____521D_59CB_5316_5B58_6863_548C_5546_57CE = ____exports.default
_____521D_59CB_5316_5B58_6863_548C_5546_57CE.name = "初始化存档和商城"
function _____521D_59CB_5316_5B58_6863_548C_5546_57CE.prototype.____constructor(self)
    __TS__New(_____5B58_6863_67E5_8BE2_6307_4EE4)
    __TS__New(_____4E3B_70AE_5B58_6863ABC)
    __TS__New(_____5B58_6863_83B7_53D6)
    __TS__New(_____7EA2_8272_89E6_624B_7684_7075_9B42_788E_7247)
    __TS__New(_____6DF1_6D77_5DE8_517D_7684_7075_9B42_788E_7247)
    __TS__New(_____5927_526F_7684_7075_9B42_788E_7247)
    __TS__New(_____53E4_8001_8005_7684_7075_9B42_788E_7247)
    __TS__New(_____795E_8BDD_6743_67C4)
    __TS__New(_____5730_56FE_7B49_7EA7_5956_52B1_63D0_793A)
    _____5730_56FE_7B49_7EA7_5956_52B1(nil)
    _____5E73_53F0_8BBA_575B_70B9_8D5E_76F8_5173_5956_52B1(nil)
    _____901A_5173_5956_52B1(nil)
    _____51FB_6740BOSS_88C5_5907_5B58_6863(nil)
    _____6DF1_5EA6_6D77_57DF_5B58_6863(nil)
    _____5386_53F2_4E2D_7684_6218_8230_788E_7247(nil)
    _____5151_6362_521D_59CB_5C5E_6027_5B58_6863(nil)
    _____795E_8BDD_6743_67C4_7D2F_8BA1_89E3_9501(nil)
    __TS__New(_____5B58_6863_5206_7C7B_91CD_7EC4)
    BaseUtil.runLater(
        0.5,
        function()
            __TS__New(_____6218_8230_788E_7247_5151_6362)
            __TS__New(_____63A2_7D22_70B9_5151_6362)
            __TS__New(_____5B58_6863_5C5E_6027)
            __TS__New(_____5168_670D_6392_884C_699C)
            __TS__New(____QQ_7FA4_52A0_7FA4_94FE_63A5)
        end
    )
    BaseUtil.runLater(
        1.2,
        function()
            _____5546_57CE(nil)
            __TS__New(_____725B_5E01_9053_5177)
            BaseUtil.runLater(
                0.2,
                function()
                    ActorTypeUtil:forAllActorTypes(
                        function(____, actorType)
                            actorType.class = "商城"
                        end,
                        "积分商城"
                    )
                    ActorTypeUtil:forAllActorTypes(
                        function(____, actorType)
                            actorType.hide = true
                        end,
                        "商城",
                        "船只魔改"
                    )
                    __TS__New(_____9B54_6539_9053_5177)
                    __TS__New(_____73A9_5BB6_8BBE_7F6E_7279_6548_7B49_5F00_5173)
                end
            )
        end
    )
end
return ____exports
