local ____lualib = require("lualib_bundle")
local __TS__SourceMapTraceBack = ____lualib.__TS__SourceMapTraceBack
__TS__SourceMapTraceBack(debug.getinfo(1).short_src, {["5"] = 4,["6"] = 4,["7"] = 4,["8"] = 4,["9"] = 4,["10"] = 4,["11"] = 4,["12"] = 4,["13"] = 4,["14"] = 4,["15"] = 4,["16"] = 4,["17"] = 4,["18"] = 4,["19"] = 4,["20"] = 4,["21"] = 4});
local ____exports = {}
____exports["l_地形34"] = {
    {x = 9792, y = 18207, z = 0, face = -44},
    {x = 15267, y = 12812, z = 0, face = 124},
    {x = 11946, y = 17710, z = -256, face = -31},
    {x = 14419, y = 16170, z = -256, face = 94},
    {x = 14298, y = 17648, z = -256, face = 158},
    {x = 13724, y = 17875, z = -256, face = -78},
    {x = 14462, y = 14326, z = -256, face = 179},
    {x = 11765, y = 14341, z = -256, face = -19},
    {x = 14541, y = 13372, z = -256, face = -176},
    {x = 12065, y = 13218, z = -256, face = 164},
    {x = 10404, y = 13686, z = -256, face = 83},
    {x = 10633, y = 15742, z = -256, face = -8},
    {x = 12741, y = 15431, z = -256, face = 156},
    {x = 10540, y = 16403, z = -236, face = 84},
    {x = 10675, y = 17830, z = 0, face = 156}
}
return ____exports
